---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ConnectorJointType
source: html/0e5890ca-66f2-d17d-a3c7-179f9bbfa22e.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ConnectorJointType Property

"Connector Joint Type"

## Syntax (C#)
```csharp
public static ForgeTypeId ConnectorJointType { get; }
```